tests/org.eclipse.wst.wsi.tests/testResources/samples/messageLogs/SecureWS/NoSecurity/NoSecurity.wsimsg

<?xml version="1.0" encoding="UTF-8"?>
<log timestamp="2007-01-16T18:14:06.005"
    xmlns="http://www.ws-i.org/testing/2004/07/log/"
    xmlns:wsi-monConfig="http://www.ws-i.org/testing/2004/07/monitorConfig/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <monitor version="1.0" releaseDate="2003-03-20">
    <implementer name="IBM" location=""/>
    <environment>
      <runtime name="Java(TM) 2 Runtime Environment, Standard Edition" version="pwi32dev-20061002a (SR3)"/>
      <operatingSystem name="Windows XP" version="5.1 build 2600 Service Pack 2"/>
      <xmlParser name="Apache Xerces" version="XML4J 4.4.6"/>
    </environment>
    <wsi-monConfig:configuration>
    <wsi-monConfig:comment>Comment</wsi-monConfig:comment>
      <wsi-monConfig:logFile replace="true" location="URL">
      <wsi-monConfig:addStyleSheet href="null" type="null" />
    </wsi-monConfig:logFile>
      <wsi-monConfig:logDuration>600</wsi-monConfig:logDuration>
      <wsi-monConfig:cleanupTimeoutSeconds>3</wsi-monConfig:cleanupTimeoutSeconds>
      <wsi-monConfig:manInTheMiddle>
      </wsi-monConfig:manInTheMiddle>
    </wsi-monConfig:configuration>
  </monitor>

<messageEntry xsi:type="httpMessageEntry" ID="1" conversationID="1" type="request" timestamp="2007-01-16T18:13:52.836Z">
<messageContent>&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:soapenc=&quot;http://schemas.xmlsoap.org/soap/encoding/&quot; xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xmlns:wsa=&quot;http://www.w3.org/2005/08/addressing&quot;&gt;&lt;soapenv:Header&gt;&lt;wsa:To&gt;http://localhost:9082/WebProjectNoSecurity/services/WebService&lt;/wsa:To&gt;&lt;wsa:Action&gt;increment&lt;/wsa:Action&gt;&lt;wsa:MessageID&gt;uuid:2D301EA6-0110-4000-E000-035C091A9DD9&lt;/wsa:MessageID&gt;&lt;/soapenv:Header&gt;&lt;soapenv:Body&gt;&lt;p619:increment xmlns:p619=&quot;http://main&quot;&gt;&lt;value&gt;1&lt;/value&gt;&lt;/p619:increment&gt;&lt;/soapenv:Body&gt;&lt;/soapenv:Envelope&gt;</messageContent>
<senderHostAndPort>localhost:9082</senderHostAndPort>
<receiverHostAndPort>localhost:9080</receiverHostAndPort>
<httpHeaders>POST /WebProjectNoSecurity/services/WebService HTTP/1.1&#xd;
Host: localhost:9080&#xd;
Accept: application/soap+xml,multipart/related,text/*&#xd;
User-Agent: IBM WebServices/1.0&#xd;
Cache-Control: no-cache&#xd;
Pragma: no-cache&#xd;
SOAPAction: &quot;increment&quot;&#xd;
Connection: Keep-Alive&#xd;
Content-Type: text/xml; charset=utf-8&#xd;
Content-Length: 622&#xd;
Date: Tue, 16 Jan 2007 23:13:52 GMT&#xd;
&#xd;
</httpHeaders>
</messageEntry>
<messageEntry xsi:type="httpMessageEntry" ID="2" conversationID="1" type="response" timestamp="2007-01-16T18:13:52.976Z">
<messageContent>&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:soapenc=&quot;http://schemas.xmlsoap.org/soap/encoding/&quot; xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xmlns:wsa=&quot;http://www.w3.org/2005/08/addressing&quot;&gt;&lt;soapenv:Header&gt;&lt;wsa:To&gt;http://www.w3.org/2005/08/addressing/anonymous&lt;/wsa:To&gt;&lt;wsa:Action&gt;http://main/WebService/incrementResponse&lt;/wsa:Action&gt;&lt;wsa:MessageID&gt;uuid:2D301F50-0110-4000-E000-035C091A9DD9&lt;/wsa:MessageID&gt;&lt;wsa:RelatesTo&gt;uuid:2D301EA6-0110-4000-E000-035C091A9DD9&lt;/wsa:RelatesTo&gt;&lt;/soapenv:Header&gt;&lt;soapenv:Body&gt;&lt;p619:incrementResponse xmlns:p619=&quot;http://main&quot;&gt;&lt;incrementReturn&gt;2&lt;/incrementReturn&gt;&lt;/p619:incrementResponse&gt;&lt;/soapenv:Body&gt;&lt;/soapenv:Envelope&gt;</messageContent>
<senderHostAndPort>localhost:9080</senderHostAndPort>
<receiverHostAndPort>localhost:9082</receiverHostAndPort>
<httpHeaders>HTTP/1.1 200 OK&#xd;
Content-Type: text/xml; charset=utf-8&#xd;
Content-Language: en-US&#xd;
Content-Length: 745&#xd;
Date: Tue, 16 Jan 2007 23:13:52 GMT&#xd;
Server: WebSphere Application Server/6.1&#xd;
&#xd;
</httpHeaders>
</messageEntry>
</log>
